levizh/zephyr/drivers/pwm/pwm_hc32_timer6.c
/*
 * Copyright (C) 2022-2024, Xiaohua Semiconductor Co., Ltd.
 * SPDX-License-Identifier: Apache-2.0
 */

#define DT_DRV_COMPAT xhsc_hc32_timer6_pwm

#include <errno.h>
#include <zephyr/kernel.h>
#include <zephyr/drivers/clock_control.h>
#include <zephyr/drivers/clock_control/hc32_clock_control.h>
#include <zephyr/drivers/interrupt_controller/intc_hc32.h>
#include <zephyr/dt-bindings/timer/hc32-timer.h>

#include <zephyr/drivers/pinctrl.h>
#include <zephyr/drivers/reset.h>
#include <zephyr/drivers/pwm.h>

#include <hc32_ll_tmr6.h>
#include <hc32_ll.h>

#include <zephyr/logging/log.h>
#include <zephyr/irq.h>

LOG_MODULE_REGISTER(pwm_hc32_timer6, CONFIG_PWM_LOG_LEVEL);

/* Timer6 max channel value for pwm, can't changed */
#define TIME6_PWM_MAX_CH                0x02U

#if defined(HC32F460)
#define TMR6_MD_TRIANGLE                TMR6_MD_TRIANGLE_A
#endif

#ifdef CONFIG_PWM_CAPTURE
/* Capture period or pulse data nums once time, max 0xFFU */
#define CAPTURE_NUMS_ONCE               0x02U
#if defined(HC32F460)
#define CAPTURE_PERIOD                  0x0000FFFFU
#elif defined(HC32F4A0)
#define CAPTURE_PERIOD                  0xFFFFFFFFU
#endif

/**
 * @brief Capture state when in 4-channel support mode
 */
typedef enum {
	CAPTURE_STATE_IDLE = 0U,
	CAPTURE_FOR_PERIOD = 1U,
	CAPTURE_FOR_PULSE = 2U,
	CAPTURE_FOR_END = 3U,
} tmr6_capture_state;

struct pwm_hc32_capture_data {
	pwm_capture_callback_handler_t callback;
	void *user_data;
	uint32_t period;
	uint32_t pulse;
	uint8_t capture_flag;
	bool continuous;
	uint8_t channel;
	uint32_t gconr_value;
	//tmr6_capture_state state;
};

#endif /*CONFIG_PWM_CAPTURE*/

/** PWM data. */
struct pwm_hc32_data {
	/** Timer clock (Hz). */
	uint32_t tim_clk;
#ifdef CONFIG_PWM_CAPTURE
	struct pwm_hc32_capture_data capture;
#endif /* CONFIG_PWM_CAPTURE */
};

/** PWM configuration. */
struct pwm_hc32_config {
	CM_TMR6_TypeDef *timer6;
	uint32_t prescaler;
	uint32_t countermode;
	uint32_t direction;
	struct hc32_modules_clock_sys clk_sys;
	const struct pinctrl_dev_config *pcfg;
#ifdef CONFIG_PWM_CAPTURE
	void (*irq_config_func)(const struct device *dev);
#endif /* CONFIG_PWM_CAPTURE */
};

static int pwm_hc32_set_cycles(const struct device *dev, uint32_t channel,
			       uint32_t period_cycles, uint32_t pulse_cycles,
			       pwm_flags_t flags)
{
	const struct pwm_hc32_config *cfg = dev->config;
	static stc_tmr6_pwm_init_t stcPwmInit;
	uint32_t u32polarity_high, u32polarity_low;
	int ret;

	if (channel < 1U || channel > TIME6_PWM_MAX_CH) {
		LOG_ERR("Invalid channel (%d)", channel);
		return -EINVAL;
	}

	/* The period_cycles cannot be greater than UINT16_MAX + 1, except U1-U4 in hc32f4a0 */
	if (period_cycles > UINT16_MAX + 1) {
#if defined(HC32F4A0)
		if (cfg->timer6 > CM_TMR6_4) {
			return -ENOTSUP;
		}
#else
		return -ENOTSUP;
#endif
	}

	if (period_cycles == 0U) {
		LOG_WRN("Set period_cycles = 0, stop timer6");
		TMR6_Stop(cfg->timer6);
		TMR6_PWM_OutputCmd(cfg->timer6, channel - 1U, DISABLE);
		return 0;
	}

#if defined(HC32F460) || defined(HC32F4A0)
	if (cfg->prescaler != 0U) {
		LOG_ERR("Cannot set PWM start level for clock-division isn't 1U");
		return -ENOTSUP;
	}
#endif
	TMR6_PWM_StructInit(&stcPwmInit);
	TMR6_ClearStatus(cfg->timer6, TMR6_FLAG_UDF | TMR6_FLAG_OVF);
	if ((flags & PWM_POLARITY_MASK) == PWM_POLARITY_NORMAL) {
		u32polarity_high = TMR6_PWM_HIGH;
		u32polarity_low = TMR6_PWM_LOW;
	} else {
		u32polarity_high = TMR6_PWM_LOW;
		u32polarity_low = TMR6_PWM_HIGH;
	}
#if defined(HC32F460)
	if (HC32_TMR_CNT_MD_SAWTOOTH == cfg->countermode) {/* TMR6_MD_SAWTOOTH */
		stcPwmInit.u32StartPolarity = u32polarity_high;
		stcPwmInit.u32CompareMatchPolarity = u32polarity_low;
		stcPwmInit.u32PeriodMatchPolarity = u32polarity_high;
		stcPwmInit.u32StopPolarity = u32polarity_low;
		if (pulse_cycles == 0U) {
			stcPwmInit.u32StartPolarity = u32polarity_low;
			stcPwmInit.u32CompareMatchPolarity = u32polarity_low;
			stcPwmInit.u32PeriodMatchPolarity = u32polarity_low;
			TMR6_Stop(cfg->timer6);
		} else if (pulse_cycles == period_cycles) {
			stcPwmInit.u32CompareMatchPolarity = u32polarity_high;
		}

		/* DIR down = 1 */
		if (cfg->direction) {
			pulse_cycles = period_cycles - pulse_cycles;
		}
		/* 0% or 100% do not to update pulse */
		if ((pulse_cycles != 0U) && (pulse_cycles != period_cycles)) {
			stcPwmInit.u32CompareValue = pulse_cycles;
		}

		TMR6_ClearStatus(cfg->timer6, TMR6_FLAG_UDF | TMR6_FLAG_OVF);
		if (cfg->timer6->GCONR & TMR6_GCONR_START) {
			/* timer6 has run */
			if (cfg->direction) {
				/* wait for underflows to update next set */
				while (RESET == TMR6_GetStatus(cfg->timer6, TMR6_FLAG_UDF)) {
					/* NOP */
				}
			} else {
				while (RESET == TMR6_GetStatus(cfg->timer6, TMR6_FLAG_OVF)) {
					/* up direction, then wait for overflows flag */
				}
			}
		} else {
			if (cfg->direction) {
				TMR6_SetCountValue(cfg->timer6, (period_cycles - 1U));
			} else {
				TMR6_SetCountValue(cfg->timer6, 0U);
			}
		}

		TMR6_SetPeriodValue(cfg->timer6, TMR6_PERIOD_REG_A, (period_cycles - 1U));
		ret = TMR6_PWM_Init(cfg->timer6, channel - 1U, &stcPwmInit);
		if (ret) {
			LOG_ERR("Could not initialize timer6 channel for pwm");
			return -EIO;
		}
	} else {
		/* TMR6_MD_TRIANGLE */
		stcPwmInit.u32StartPolarity = u32polarity_low;
		stcPwmInit.u32StopPolarity = u32polarity_low;
		stcPwmInit.u32CompareMatchPolarity = TMR6_PWM_INVT;
		stcPwmInit.u32PeriodMatchPolarity = TMR6_PWM_HOLD;

		if (pulse_cycles == 0U) {
			stcPwmInit.u32CompareMatchPolarity = u32polarity_low;
		} else if (pulse_cycles == period_cycles) {
			stcPwmInit.u32StartPolarity = u32polarity_high;
			stcPwmInit.u32CompareMatchPolarity = u32polarity_high;
		}

		stcPwmInit.u32CompareValue = (period_cycles - pulse_cycles) / 2U;

		/* check if timer6 has start */
		if (cfg->timer6->GCONR & TMR6_GCONR_START) {
			TMR6_ClearStatus(cfg->timer6, TMR6_FLAG_UDF);
			/* wait for underflows to update next set */
			while (RESET == TMR6_GetStatus(cfg->timer6, TMR6_FLAG_UDF)) {
				/* NOP */
			}
			/* for TRIANGLE mode must stop timer6 to change the polarity and start level */
			TMR6_Stop(cfg->timer6);
		} else {
			TMR6_SetCountValue(cfg->timer6, stcPwmInit.u32CompareValue);
		}
		TMR6_SetPeriodValue(cfg->timer6, TMR6_PERIOD_REG_A, period_cycles / 2U);
		ret = TMR6_PWM_Init(cfg->timer6, channel - 1U, &stcPwmInit);
		if (ret) {
			LOG_ERR("Could not initialize timer6 channel for pwm");
			return -EIO;
		}
	}
#elif defined(HC32F4A0)
	stcPwmInit.u32CountUpMatchAPolarity = TMR6_PWM_HOLD;
	stcPwmInit.u32CountDownMatchAPolarity = TMR6_PWM_HOLD;
	stcPwmInit.u32CountUpMatchBPolarity = TMR6_PWM_HOLD;
	stcPwmInit.u32CountDownMatchBPolarity = TMR6_PWM_HOLD;
	stcPwmInit.u32UdfPolarity = TMR6_PWM_HOLD;
	stcPwmInit.u32OvfPolarity = TMR6_PWM_HOLD;

	if (HC32_TMR_CNT_MD_SAWTOOTH == cfg->countermode) {/* TMR6_MD_SAWTOOTH */
		stcPwmInit.u32StartPolarity  = u32polarity_high;
		stcPwmInit.u32StopPolarity   = u32polarity_low;
		if (cfg->direction) {
			/* count down */
			stcPwmInit.u32CountDownMatchAPolarity = u32polarity_low;
			stcPwmInit.u32CountDownMatchBPolarity = u32polarity_low;
			stcPwmInit.u32UdfPolarity = u32polarity_high;

		} else { /* count up */
			stcPwmInit.u32CountUpMatchAPolarity = u32polarity_low;
			stcPwmInit.u32CountUpMatchBPolarity = u32polarity_low;
			stcPwmInit.u32OvfPolarity = u32polarity_high;
		}

		if (pulse_cycles == 0U) {
			stcPwmInit.u32StartPolarity = u32polarity_low;
			stcPwmInit.u32CountDownMatchAPolarity = u32polarity_low;
			stcPwmInit.u32CountUpMatchAPolarity = u32polarity_low;
			stcPwmInit.u32CountDownMatchBPolarity = u32polarity_low;
			stcPwmInit.u32CountUpMatchBPolarity = u32polarity_low;
			stcPwmInit.u32UdfPolarity = u32polarity_low;
			stcPwmInit.u32OvfPolarity = u32polarity_low;
		} else if (pulse_cycles == period_cycles) {
			stcPwmInit.u32CountDownMatchAPolarity = u32polarity_high;
			stcPwmInit.u32CountUpMatchAPolarity = u32polarity_high;
			stcPwmInit.u32CountDownMatchBPolarity = u32polarity_high;
			stcPwmInit.u32CountUpMatchBPolarity = u32polarity_high;
		}

		/* DIR down = 1 */
		if (cfg->direction) {
			stcPwmInit.u32CompareValue = period_cycles - pulse_cycles;
		} else {
			stcPwmInit.u32CompareValue = pulse_cycles;
		}

		TMR6_ClearStatus(cfg->timer6, TMR6_FLAG_UDF | TMR6_FLAG_OVF);
		if (cfg->direction) {
			if (cfg->timer6->GCONR & TMR6_GCONR_START) {
				/* timer6 has run */
				/* Dir down, wait for underflows to update next set */
				while (RESET == TMR6_GetStatus(cfg->timer6, TMR6_FLAG_UDF)) {
					/* NOP */
				}
			} else {
				/* Dir down need to set count (period_cycles - 1U) */
				TMR6_SetCountValue(cfg->timer6, (period_cycles - 1U));
			}
		} else {
			if (cfg->timer6->GCONR & TMR6_GCONR_START) {
				while (RESET == TMR6_GetStatus(cfg->timer6, TMR6_FLAG_OVF)) {
					/* up direction, then wait for overflows flag */
				}
			} else {
				TMR6_SetCountValue(cfg->timer6, 0U);
			}
		}
		if (pulse_cycles == 0U) {
			TMR6_Stop(cfg->timer6);
		}
		TMR6_SetPeriodValue(cfg->timer6, TMR6_PERIOD_REG_A, (period_cycles - 1U));
		ret = TMR6_PWM_Init(cfg->timer6, channel - 1U, &stcPwmInit);
		if (ret) {
			LOG_ERR("Could not initialize timer6 channel for pwm");
			return -EIO;
		}
		TMR6_SetCompareValue(cfg->timer6, TMR6_CMP_REG_A, stcPwmInit.u32CompareValue);
	} else {
		/* TMR6_MD_TRIANGLE */
		stcPwmInit.u32StartPolarity = u32polarity_high;
		stcPwmInit.u32StopPolarity = u32polarity_low;
		stcPwmInit.u32UdfPolarity = u32polarity_high;
		stcPwmInit.u32OvfPolarity = u32polarity_high;
		stcPwmInit.u32CountUpMatchAPolarity = u32polarity_low;
		stcPwmInit.u32CountDownMatchBPolarity = u32polarity_low;

		if (pulse_cycles == 0U) {
			stcPwmInit.u32StartPolarity = u32polarity_low;
			stcPwmInit.u32UdfPolarity = u32polarity_low;
			stcPwmInit.u32OvfPolarity = u32polarity_low;
		} else if (pulse_cycles == period_cycles) {
			stcPwmInit.u32CountUpMatchAPolarity = u32polarity_high;
			stcPwmInit.u32CountDownMatchBPolarity = u32polarity_high;
		}

		/* check if timer6 has start */
		if (cfg->timer6->GCONR & TMR6_GCONR_START) {
			/* wait for underflows to update next set */
			TMR6_ClearStatus(cfg->timer6, TMR6_FLAG_UDF);
			while (RESET == TMR6_GetStatus(cfg->timer6, TMR6_FLAG_UDF)) {
				/* NOP */
			}
			if (pulse_cycles == 0U) {
				TMR6_Stop(cfg->timer6);
				TMR6_SetCountValue(cfg->timer6, 1U);
			}
		} else {
			TMR6_SetCountValue(cfg->timer6, 1U);
		}
		TMR6_SetPeriodValue(cfg->timer6, TMR6_PERIOD_REG_A, period_cycles);
		ret = TMR6_PWM_Init(cfg->timer6, channel - 1U, &stcPwmInit);
		if (ret) {
			LOG_ERR("Could not initialize timer6 channel for pwm");
			return -EIO;
		}
		TMR6_SetCompareValue(cfg->timer6, TMR6_CMP_REG_A, pulse_cycles);
		TMR6_SetCompareValue(cfg->timer6, TMR6_CMP_REG_B, period_cycles - pulse_cycles);
	}
#endif
	TMR6_SetFunc(cfg->timer6, channel - 1U, TMR6_PIN_CMP_OUTPUT);
	TMR6_PWM_OutputCmd(cfg->timer6, channel - 1U, ENABLE);
	TMR6_Start(cfg->timer6);
	return 0;
}

