levizh/zephyr/drivers/pwm/pwm_hc32_timer6.c
#ifdef CONFIG_PWM_CAPTURE
static uint32_t hc32_get_average_value(uint32_t *capt, uint8_t data_len)
{
	uint64_t diff = 0U;
	for (uint8_t i = 0U; i < data_len; i++) {
		diff += *capt++;
	}
	return (uint32_t)(diff / data_len);
}

static int pwm_hc32_configure_capture(const struct device *dev,
				      uint32_t channel, pwm_flags_t flags,
				      pwm_capture_callback_handler_t cb,
				      void *user_data)
{
	const struct pwm_hc32_config *cfg = dev->config;
	struct pwm_hc32_data *data = dev->data;
	struct pwm_hc32_capture_data *cpt = &data->capture;
	uint32_t cond_rising = 0U, cond_falling = 0U;
	uint32_t cond_rising_clr = 0U, cond_falling_clr = 0U;
	uint32_t cond_start_rising = 0U, cond_start_falling = 0U;

	if (channel < 1U || channel >= CHANNEL_CAPTURE_TMR6_MAX_CH) {
		LOG_ERR("Invalid channel (%d)", channel);
		return -EINVAL;
	}

	/* check if timer6 has start */
	if (cfg->timer6->HSTAR & TMR6_HSTAR_STAS) {
		LOG_ERR("Cannot set capture, the timer6 unit is in progress");
		return -EBUSY;
	}

	if (0U == (flags & PWM_CAPTURE_TYPE_MASK)) {
		LOG_ERR("No period or pulse set to capture!");
		return -EINVAL;
	}

	cpt->callback = cb;
	cpt->user_data = user_data;
	cpt->capture_flag = (flags & PWM_CAPTURE_TYPE_MASK);
	cpt->continuous = (flags & PWM_CAPTURE_MODE_CONTINUOUS) ? true : false;
	cpt->channel = channel;

	switch (channel) {
	case CHANNEL_CAPTURE_TMR6_PWMA:
		cond_rising = TMR6_CAPT_COND_PWMA_RISING;
		cond_falling = TMR6_CAPT_COND_PWMA_FALLING;
		cond_rising_clr = TMR6_CLR_COND_PWMA_RISING;
		cond_falling_clr = TMR6_CLR_COND_PWMA_FALLING;
		cond_start_rising = TMR6_START_COND_PWMA_RISING;
		cond_start_falling = TMR6_START_COND_PWMA_FALLING;
		break;

	case CHANNEL_CAPTURE_TMR6_PWMB:
		cond_rising = TMR6_CAPT_COND_PWMB_RISING;
		cond_falling = TMR6_CAPT_COND_PWMB_FALLING;
		cond_rising_clr = TMR6_CLR_COND_PWMB_RISING;
		cond_falling_clr = TMR6_CLR_COND_PWMB_FALLING;
		cond_start_rising = TMR6_START_COND_PWMB_RISING;
		cond_start_falling = TMR6_START_COND_PWMB_FALLING;
		break;

	case CHANNEL_CAPTURE_TMR6_TRIGA:
		cond_rising = TMR6_CAPT_COND_TRIGA_RISING;
		cond_falling = TMR6_CAPT_COND_TRIGA_FALLING;
		cond_rising_clr = TMR6_CLR_COND_TRIGA_RISING;
		cond_falling_clr = TMR6_CLR_COND_TRIGA_FALLING;
		cond_start_rising = TMR6_START_COND_TRIGA_RISING;
		cond_start_falling = TMR6_START_COND_TRIGA_FALLING;
		break;

	case CHANNEL_CAPTURE_TMR6_TRIGB:
		cond_rising = TMR6_CAPT_COND_TRIGB_RISING;
		cond_falling = TMR6_CAPT_COND_TRIGB_FALLING;
		cond_rising_clr = TMR6_CLR_COND_TRIGB_RISING;
		cond_falling_clr = TMR6_CLR_COND_TRIGB_FALLING;
		cond_start_rising = TMR6_START_COND_TRIGB_RISING;
		cond_start_falling = TMR6_START_COND_TRIGB_FALLING;
		break;
#if defined(HC32F4A0)
	case CHANNEL_CAPTURE_TMR6_TRIGC:
		cond_rising = TMR6_CAPT_COND_TRIGC_RISING;
		cond_falling = TMR6_CAPT_COND_TRIGC_FALLING;
		cond_rising_clr = TMR6_CLR_COND_TRIGC_RISING;
		cond_falling_clr = TMR6_CLR_COND_TRIGC_FALLING;
		cond_start_rising = TMR6_START_COND_TRIGC_RISING;
		cond_start_falling = TMR6_START_COND_TRIGC_FALLING;
		break;

	case CHANNEL_CAPTURE_TMR6_TRIGD:
		cond_rising = TMR6_CAPT_COND_TRIGD_RISING;
		cond_falling = TMR6_CAPT_COND_TRIGD_FALLING;
		cond_rising_clr = TMR6_CLR_COND_TRIGD_RISING;
		cond_falling_clr = TMR6_CLR_COND_TRIGD_FALLING;
		cond_start_rising = TMR6_START_COND_TRIGD_RISING;
		cond_start_falling = TMR6_START_COND_TRIGD_FALLING;
		break;
#endif
	}

	if (flags & PWM_CAPTURE_TYPE_PERIOD) {
		/* rising to clear and capture */
		if (flags & PWM_POLARITY_MASK) {
			TMR6_HWCaptureCondCmd(cfg->timer6, TMR6_CH_A, cond_falling, ENABLE);
			TMR6_HWClearCondCmd(cfg->timer6, cond_falling_clr, ENABLE);
			TMR6_HWStartCondCmd(cfg->timer6, cond_start_falling, ENABLE);
		} else {
			TMR6_HWCaptureCondCmd(cfg->timer6, TMR6_CH_A, cond_rising, ENABLE);
			TMR6_HWClearCondCmd(cfg->timer6, cond_rising_clr, ENABLE);
			TMR6_HWStartCondCmd(cfg->timer6, cond_start_rising, ENABLE);
		}
	}
	if (flags & PWM_CAPTURE_TYPE_PULSE) {
		if (flags & PWM_POLARITY_MASK) {
			TMR6_HWClearCondCmd(cfg->timer6, cond_falling_clr, ENABLE);
			TMR6_HWStartCondCmd(cfg->timer6, cond_start_falling, ENABLE);
			TMR6_HWCaptureCondCmd(cfg->timer6, TMR6_CH_B, cond_rising, ENABLE);
		} else {
			TMR6_HWClearCondCmd(cfg->timer6, cond_rising_clr, ENABLE);
			TMR6_HWStartCondCmd(cfg->timer6, cond_start_rising, ENABLE);
			TMR6_HWCaptureCondCmd(cfg->timer6, TMR6_CH_B, cond_falling, ENABLE);
		}
	}
#if defined(HC32F4A0)
	if (cfg->timer6 > CM_TMR6_4) {
		TMR6_SetPeriodValue(cfg->timer6, TMR6_PERIOD_REG_A,
				    CAPTURE_PERIOD & 0x0000ffffU);
	} else
#endif
	{
		TMR6_SetPeriodValue(cfg->timer6, TMR6_PERIOD_REG_A, CAPTURE_PERIOD);
	}
	TMR6_SetFunc(cfg->timer6, TMR6_CH_A, TMR6_PIN_CAPT_INPUT);
	TMR6_SetFunc(cfg->timer6, TMR6_CH_B, TMR6_PIN_CAPT_INPUT);
	return 0;
}

static int pwm_hc32_enable_capture(const struct device *dev,
				   uint32_t channel)
{
	const struct pwm_hc32_config *cfg = dev->config;
	struct pwm_hc32_data *data = dev->data;
	struct pwm_hc32_capture_data *cpt = &data->capture;

	if (channel < 1U || channel >= CHANNEL_CAPTURE_TMR6_MAX_CH) {
		LOG_ERR("Invalid channel (%d)", channel);
		return -EINVAL;
	}

	if ((!data->capture.callback) || (channel != cpt->channel)) {
		LOG_ERR("PWM capture not configured or wrong channel");
		return -EINVAL;
	}

	/* check if timer6 has start */
	if (cfg->timer6->HSTAR & TMR6_HSTAR_STAS) {
		LOG_ERR("The timer6 unit is in progress, PWM capture already active");
		return -EBUSY;
	}

	/* Store original GCONR and set to SAWTOOTH, dir up */
	cpt->gconr_value = cfg->timer6->GCONR;
	TMR6_SetCountValue(cfg->timer6, 0U);
	TMR6_SetCountDir(cfg->timer6, TMR6_CNT_UP);
	TMR6_SetCountMode(cfg->timer6, TMR6_MD_SAWTOOTH);

	TMR6_HWClearCmd(cfg->timer6, ENABLE);
	TMR6_HWStartCmd(cfg->timer6, ENABLE);
	TMR6_ClearStatus(cfg->timer6, TMR6_FLAG_CLR_ALL);
	TMR6_IntCmd(cfg->timer6, TMR6_INT_MATCH_A | TMR6_INT_MATCH_B, ENABLE);
	return 0;
}

static int pwm_hc32_disable_capture(const struct device *dev,
				    uint32_t channel)
{
	const struct pwm_hc32_config *cfg = dev->config;
	struct pwm_hc32_data *data = dev->data;
	struct pwm_hc32_capture_data *cpt = &data->capture;

	if (channel < 1U || channel >= CHANNEL_CAPTURE_TMR6_MAX_CH) {
		LOG_ERR("Invalid channel (%d)", channel);
		return -EINVAL;
	}
	if (channel != cpt->channel) {
		LOG_ERR("Running channel isn't this channel!");
		return -EINVAL;
	}

	TMR6_IntCmd(cfg->timer6, TMR6_INT_ALL, DISABLE);
	TMR6_HWClearCmd(cfg->timer6, DISABLE);
	TMR6_HWStartCmd(cfg->timer6, DISABLE);
	cfg->timer6->GCONR = cpt->gconr_value;
	TMR6_Stop(cfg->timer6);
	TMR6_HWCaptureCondCmd(cfg->timer6, TMR6_CH_A, TMR6_CAPT_COND_ALL,
			      DISABLE);
	TMR6_HWCaptureCondCmd(cfg->timer6, TMR6_CH_B, TMR6_CAPT_COND_ALL,
			      DISABLE);
	TMR6_HWClearCondCmd(cfg->timer6, TMR6_CLR_COND_ALL, DISABLE);
	TMR6_HWStartCondCmd(cfg->timer6, TMR6_START_COND_ALL, DISABLE);
	TMR6_ClearStatus(cfg->timer6, TMR6_FLAG_CLR_ALL);
	return 0;
}

