levizh/zephyr/drivers/pwm/pwm_hc32_timer6.c
static void pwm_hc32_isr(const struct device *dev)
{
	const struct pwm_hc32_config *cfg = dev->config;
	struct pwm_hc32_data *data = dev->data;
	struct pwm_hc32_capture_data *cpt = &data->capture;
	static uint8_t status = 0U;
	static uint32_t period_data[CAPTURE_NUMS_ONCE + 1U],
	       pulse_data[CAPTURE_NUMS_ONCE+1U];
	static uint8_t  i = 0U, j = 0U;

	if ((SET == TMR6_GetStatus(cfg->timer6, TMR6_FLAG_MATCH_A))
	    && (cpt->capture_flag & PWM_CAPTURE_TYPE_PERIOD)) {
		period_data[i++] = TMR6_GetCompareValue(cfg->timer6, TMR6_CMP_REG_A);
		if (i > CAPTURE_NUMS_ONCE) {
			TMR6_IntCmd(cfg->timer6, TMR6_INT_MATCH_A, DISABLE);
			status |= PWM_CAPTURE_TYPE_PERIOD;
			i = 0U;
		}
		TMR6_ClearStatus(cfg->timer6, TMR6_FLAG_MATCH_A);
	}

	if ((SET == TMR6_GetStatus(cfg->timer6, TMR6_FLAG_MATCH_B))
	    && (cpt->capture_flag & PWM_CAPTURE_TYPE_PULSE)) {
		pulse_data[j++] = TMR6_GetCompareValue(cfg->timer6, TMR6_CMP_REG_B);
		if (j > CAPTURE_NUMS_ONCE) {
			TMR6_IntCmd(cfg->timer6, TMR6_INT_MATCH_B, DISABLE);
			status |= PWM_CAPTURE_TYPE_PULSE;
			j = 0U;
		}
		TMR6_ClearStatus(cfg->timer6, TMR6_FLAG_MATCH_B);
	}

	if (status == cpt->capture_flag) {
		/* done */
		status = 0U;
		i = 0U;
		j = 0U;
		cpt->period = hc32_get_average_value(&period_data[1U], CAPTURE_NUMS_ONCE);
		cpt->pulse = hc32_get_average_value(&pulse_data[1U], CAPTURE_NUMS_ONCE);
		cpt->callback(dev, cpt->channel, cpt->period, cpt->pulse, 0U, cpt->user_data);
		if (!cpt->continuous) {
			pwm_hc32_disable_capture(dev, cpt->channel);
		} else {
			TMR6_IntCmd(cfg->timer6, TMR6_INT_MATCH_A | TMR6_INT_MATCH_B, ENABLE);
			TMR6_ClearStatus(cfg->timer6, TMR6_FLAG_CLR_ALL);
		}
		memset(period_data, 0U, sizeof(period_data));
		memset(pulse_data, 0U, sizeof(pulse_data));
	}
}
#endif /* CONFIG_PWM_CAPTURE */

static int pwm_hc32_get_cycles_per_sec(const struct device *dev,
				       uint32_t channel, uint64_t *cycles)
{
	struct pwm_hc32_data *data = dev->data;
	const struct pwm_hc32_config *cfg = dev->config;
	uint32_t bus_clk = data->tim_clk;

	for (uint8_t i = 0U; i < cfg->prescaler; i++) {
		bus_clk >>= 1;
	}
	*cycles = (uint64_t)bus_clk;

	return 0;
}

static const struct pwm_driver_api pwm_hc32_driver_api = {
	.set_cycles = pwm_hc32_set_cycles,
	.get_cycles_per_sec = pwm_hc32_get_cycles_per_sec,
#ifdef CONFIG_PWM_CAPTURE
	.configure_capture = pwm_hc32_configure_capture,
	.enable_capture = pwm_hc32_enable_capture,
	.disable_capture = pwm_hc32_disable_capture,
#endif /* CONFIG_PWM_CAPTURE */
};

static int pwm_hc32_init(const struct device *dev)
{
	const struct pwm_hc32_config *cfg = dev->config;
	struct pwm_hc32_data *data = dev->data;
	stc_tmr6_init_t stcTmr6Init;
	int ret;

	/* TIMER6 clock open */
	ret = clock_control_on(DEVICE_DT_GET(DT_NODELABEL(clk_sys)),
			       (clock_control_subsys_t)&cfg->clk_sys);

	if (ret < 0) {
		LOG_ERR("Could not initialize clock (%d)", ret);
		return ret;
	}

	/* configure pinmux */
	ret = pinctrl_apply_state(cfg->pcfg, PINCTRL_STATE_DEFAULT);
	if (ret < 0) {
		LOG_ERR("PWM pinctrl setup failed (%d)", ret);
		return ret;
	}

	TMR6_DeInit(cfg->timer6);
	/* initialize timer */
	(void)TMR6_StructInit(&stcTmr6Init);
	stcTmr6Init.sw_count.u32ClockDiv  = cfg->prescaler;
	stcTmr6Init.sw_count.u32CountMode = (cfg->countermode) ? TMR6_MD_TRIANGLE :
					    TMR6_MD_SAWTOOTH;
	if (!(cfg->countermode)) {
		/* Only SAWTOOTH mode can set dir */
		stcTmr6Init.sw_count.u32CountDir  = cfg->direction ? TMR6_CNT_DOWN :
						    TMR6_CNT_UP;
	}
	stcTmr6Init.u32PeriodValue = 0xFFFFU;
#if defined(HC32F4A0)
	if (cfg->timer6 <= CM_TMR6_4) {
		stcTmr6Init.u32PeriodValue = 0xFFFFFFFFU;
	}
#endif

	ret = TMR6_Init(cfg->timer6, &stcTmr6Init);
	if (ret) {
		LOG_ERR("TMR6_Init error (%d)", ret);
		return -EIO;
	}

	ret = clock_control_get_rate(DEVICE_DT_GET(DT_NODELABEL(clk_sys)),
				     (clock_control_subsys_t)&cfg->clk_sys, &(data->tim_clk));
	if (ret < 0) {
		LOG_ERR("Could not obtain timer6 clock (%d)", ret);
		return ret;
	}
#ifdef CONFIG_PWM_CAPTURE
	cfg->irq_config_func(dev);
#endif /* CONFIG_PWM_CAPTURE */
	return 0;
}

#define PWM(inst) DT_INST_PARENT(inst)

#ifdef CONFIG_PWM_CAPTURE
#define IDX_IRQ_CONFIGURE(idx, inst)                                                           \
		IRQ_CONNECT(DT_IRQ_BY_IDX(PWM(inst),idx, irq), DT_IRQ_BY_IDX(PWM(inst),idx, priority), \
			    pwm_hc32_isr, DEVICE_DT_INST_GET(inst), 0);                                    \
		hc32_intc_irq_signin(DT_IRQ_BY_IDX(PWM(inst),idx, irq),                                \
						 DT_IRQ_BY_IDX(PWM(inst),idx, int_src));                               \
		irq_enable(DT_IRQ_BY_IDX(PWM(inst),idx, irq));

#define CONFIGURE_ALL_IRQS(inst, idxs)  LISTIFY(idxs, IDX_IRQ_CONFIGURE, (), inst)

#define HC32_IRQ_CONFIGURE(inst)                                         \
	static void pwm_hc32_irq_config_func_##inst(const struct device *dev)\
	{                                                                    \
		CONFIGURE_ALL_IRQS(inst, DT_NUM_IRQS(PWM(inst)));                \
	}

#define CAPTURE_INIT(index)                        \
	.irq_config_func = pwm_hc32_irq_config_func_##index,

#endif /* CONFIG_PWM_CAPTURE */


#define PWM_DEVICE_INIT(index)                                         \
	static struct pwm_hc32_data pwm_hc32_data_##index = {		       \
	\
	};								                                   \
	PINCTRL_DT_INST_DEFINE(index);                                     \
	IF_ENABLED(CONFIG_PWM_CAPTURE, (HC32_IRQ_CONFIGURE(index)));       \
	static const struct pwm_hc32_config pwm_hc32_config_##index = {    \
		.timer6 = (CM_TMR6_TypeDef *)DT_REG_ADDR(PWM(index)),	       \
		.prescaler = DT_PROP(PWM(index), clock_division),		       \
		.countermode = DT_PROP(PWM(index), count_mode),	               \
		.direction = DT_PROP(PWM(index), count_direction),	           \
		.clk_sys = {                                                   \
		.bus = DT_CLOCKS_CELL(PWM(index), bus),                        \
		.fcg = DT_CLOCKS_CELL(PWM(index), fcg),                        \
		.bits = DT_CLOCKS_CELL(PWM(index), bits)                       \
		},\
		.pcfg = PINCTRL_DT_INST_DEV_CONFIG_GET(index),		           \
		IF_ENABLED(CONFIG_PWM_CAPTURE, (CAPTURE_INIT(index)))          \
	};                                                                 \
	DEVICE_DT_INST_DEFINE(index, &pwm_hc32_init, NULL,                 \
			    &pwm_hc32_data_##index,                                \
			    &pwm_hc32_config_##index, POST_KERNEL,                 \
			    CONFIG_PWM_INIT_PRIORITY,                              \
			    &pwm_hc32_driver_api);

DT_INST_FOREACH_STATUS_OKAY(PWM_DEVICE_INIT)
